/*
一家工厂生产的产品被装入相同高度h的方形包装袋中，
尺寸为1X1,2X2、3X3、4X4、5 X5、6X6。
这些产品总是以与产品相同高度h的方形包装袋形式交付给客户，且尺寸亦为6X6。
由于存在相关费用，因此对于工厂和客户而言，
尽可能减少从工厂到客户处交付所订购产品所需的包装袋数量，不仅符合双方的利益。
一个能有效解决根据订单找到所需最小包装袋数量问题的优秀程序，
将能节省大量资金。你被要求编写这样一个程序。

输入 
输入文件包含若干行，用于指定订单。
每行都指定一项订单。订单的描述由六组整数组成，
各组之间用一个空格分隔依次表示从最小尺寸1X1到最大尺寸6>6的各包数量。
输入文件的末尾由包含六组零的行来标识。

输出
输出文件中的每一行都对应于输入文件中的一行。
该行包含可将来自相应行输入文件中的订单打包成数量最少的包裹的信息。
输出文件中并不存在与输入文件最后那行“空”行相对应的相应行。 

样例输入
0 0 4 0 0 1 
7 5 1 0 0 0 
0 0 0 0 0 0 

样例输出
2
1
*/
#include<stdio.h>
int main(){
	
	
	
	
	
	return 0;
}




